---
kind: enumMember
id: F:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule.QuantityTable
enum: Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule
source: html/7fa26a3f-1640-4497-c60d-ac7af7624bb7.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule.QuantityTable

This rule will apply the demand factor for the total quantity of attached objects to a panel.
 It is purely a look-up table. For example, the user can specify that 0 to 2 objects get 100% and
 2 to 4 objects get 85% and so on.